### 9번 문제

In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [12]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
pd.options.display.max_colwidth = 80
pd.options.display.max_columns = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [7]:
data = { 
    "이름": ['철수', '영희', '민수', '지영'], 
    "나이": [25, 30, 22, 28], 
    "성별": ['남자', '여자', '남자', '여자'] }
frame = pd.DataFrame(data)
frame

   이름  나이  성별
0  철수  25  남자
1  영희  30  여자
2  민수  22  남자
3  지영  28  여자

### 10번 문제

In [8]:
data = {
    "col1": ['a', 'b', 'c'],
    "col2": [1, 2, 3]}
frame = pd.DataFrame(data)
frame

  col1  col2
0    a     1
1    b     2
2    c     3

In [9]:
 frame.loc[:2, 'col1':'col2']

  col1  col2
0    a     1
1    b     2
2    c     3

### 12번 문제

In [17]:
df1 = pd.DataFrame({"col1": ["a", "b", "c"],
                    "col2": [1, 2, 3]})
df2 = pd.DataFrame({"col3": ["a", "b", "f"],
                    "col4": [10, 20, 30]})
print(df1,"\n\n", df2)

pd.merge(df1, df2, left_on="col1", right_on="col3", how="outer")

  col1  col2
0    a     1
1    b     2
2    c     3

   col3  col4
0    a    10
1    b    20
2    f    30

  col1  col2 col3  col4
0    a   1.0    a  10.0
1    b   2.0    b  20.0
2    c   3.0  NaN   NaN
3  NaN   NaN    f  30.0

### 13번 문제

In [19]:
data = {
    "name": ['철수', '영희', '민수', '지영'],
    "score": [75, 88, 92, 68]}
df = pd.DataFrame(data)
df

  name  score
0   철수     75
1   영희     88
2   민수     92
3   지영     68

In [35]:
df1 = df[df['score'] >= 80]
df1

  names  score
1    영희     88
2    민수     92
4    다현     95

### 16번 문제

In [22]:
df = pd.DataFrame({"col1": [1, 2, 3],
                    "col2": [4, 5, 6]})
df

   col1  col2
0     1     4
1     2     5
2     3     6

In [23]:
df.apply(lambda row: row['col1'] + row['col2'], axis="columns")

0    5
1    7
2    9
dtype: int64

### 17번 문제

In [28]:
df1 = pd.DataFrame({"names": ['철수', '영희', '민수'],
                    "score": [75, 88, 92] })

df2 = pd.DataFrame({"names": ['지영', '다현'],
                    "score": [68, 95]})

In [29]:
dataframe_list = [df1, df2]
pd.concat(dataframe_list, axis="index") #pd.concat(dataframe_list)
# 인덱스 재설정
df = pd.concat(dataframe_list, ignore_index=True)
df

  names  score
0    철수     75
1    영희     88
2    민수     92
3    지영     68
4    다현     95

### 18번 문제

In [36]:
df1 = pd.DataFrame({"names": ['철수', '영희', '민수'],
                    "score": [75, 88, 92] })

df2 = pd.DataFrame({"names": ['영희', '철수', '지영', '다현'],
                    "attendence_rate": [90, 80, 95, 85]})

In [38]:
df3 = pd.merge(df1, df2, on = "names" , how = "inner")
df3

  names  score  attendence_rate
0    철수     75               80
1    영희     88               90

### 22번 문제

In [39]:
data = {
    '이름': ['철수', '영희', '민수', '지영'],
    '나이': [25, 30, 22, 28],
    '성별': ['남자', '여자', '남자', '여자']
}

# 딕셔너리 데이터를 데이터프레임으로 변환
df = pd.DataFrame(data)

# CSV 파일로 저장
csv_file_path = "data.csv"
df.to_csv(csv_file_path, index=False)

# JSON 파일로 저장
json_file_path = "data.json"
df.to_json(json_file_path, orient="records")

### 25번 문제

In [40]:
df1 = pd.DataFrame({"학생": ['철수', '영희', '민수'],
                    "성적": [80, 75, 90] })

# 시리즈 new_student_scores 생성
new_student_scores = pd.DataFrame({"학생": ['지영'],
                                   "성적": [85] })

# concat() 함수를 사용하여 데이터프레임과 시리즈를 수직으로 결합
result = pd.concat([df1, new_student_scores], ignore_index=True)

# 결과 출력
print(result)

   학생  성적
0  철수  80
1  영희  75
2  민수  90
3  지영  85

In [41]:
df1 = pd.DataFrame({"학생": ['철수', '영희', '민수'],
                    "성적": [80, 75, 90] })

# 시리즈 new_student_scores 생성
new_student_scores = pd.DataFrame({"학생": ['지영'],
                                   "성적": [85] })

# merge() 함수를 사용하여 데이터프레임과 시리즈를 병합
result = pd.merge(df1, new_student_scores, how='outer')

# 결과 출력
print(result)

   학생  성적
0  민수  90
1  영희  75
2  지영  85
3  철수  80

### 26번 문제

In [47]:
df1 = pd.DataFrame({"A": [1, 2, 3],
                    "B": [4, 5, 6] },
                   index = ['X','Y','Z'])
df2 = pd.DataFrame({"C": [7, 8, 9],
                    "D": [10, 11, 12] },
                   index = ['X','Y','Z'])
s = pd.Series({'X': 13, 'Y': 14, 'Z': 15},
                 name = 'E')

In [50]:
result_df = pd.concat([df1, df2], axis=1)

# 시리즈 s를 데이터프레임으로 변환하여 수평으로 결합
result = pd.concat([result_df, pd.DataFrame(s)], axis=1)

# 결과 출력
print("pandas.concat() 결과: \n",result)

pandas.concat() 결과:
    A  B  C   D   E
X  1  4  7  10  13
Y  2  5  8  11  14
Z  3  6  9  12  15

In [54]:
result = pd.merge(df1, df2, left_index=True, right_index=True)

# 시리즈 s를 데이터프레임으로 변환하여 병합
s_df = pd.DataFrame(s).T

# 결과 데이터프레임과 시리즈 s를 수평으로 결합
result = pd.concat([result, s_df], axis=1)

# 결과 출력
print(result)

     A    B    C     D     X     Y     Z
X  1.0  4.0  7.0  10.0   NaN   NaN   NaN
Y  2.0  5.0  8.0  11.0   NaN   NaN   NaN
Z  3.0  6.0  9.0  12.0   NaN   NaN   NaN
E  NaN  NaN  NaN   NaN  13.0  14.0  15.0

### 27번 문제

In [55]:
df = pd.DataFrame({"이름": ['철수', '영희', '민수'],
                   "국어": [90, 80, 85],
                   "영어": [85, 95, 70],
                   "수학": [75, 80, 90] })

In [57]:
df['총점'] = df.apply(lambda row: row['국어'] + row['영어'] + row['수학'], axis=1)
df

   이름  국어  영어  수학   총점
0  철수  90  85  75  250
1  영희  80  95  80  255
2  민수  85  70  90  245

In [58]:
df.loc['평균'] = df[['국어', '영어', '수학']].apply(lambda x: x.mean())
df

     이름    국어         영어         수학     총점
0    철수  90.0  85.000000  75.000000  250.0
1    영희  80.0  95.000000  80.000000  255.0
2    민수  85.0  70.000000  90.000000  245.0
평균  NaN  85.0  83.333333  81.666667    NaN